In [2]:
import pandas as pd

In [8]:
#help(pd.ExcelWriter) # 이 두 개는 외우기
#help(pd.read_excel)

In [14]:
df1 = pd.read_excel("학생시험성적.xlsx")

In [17]:
df2 = pd.read_excel("학생시험성적.xlsx", sheet_name = "2차시험", index_col = 0)

In [18]:
df1.values

array([['A', 80, 90, 85, 85.0],
       ['B', 90, 95, 95, 93.33333333333333],
       ['C', 95, 70, 75, 80.0],
       ['D', 70, 85, 80, 78.33333333333333],
       ['E', 75, 90, 85, 83.33333333333333]], dtype=object)

In [19]:
df2

    과학  사회   역사         평균
학생
A   90  95   85  90.000000
B   85  90   80  85.000000
C   70  80   75  75.000000
D   75  90  100  88.333333
E   90  80   90  86.666667

In [20]:
import pandas as pd

excel_exam_data1 = {'학생': ['A', 'B', 'C', 'D', 'E', 'F'],
                    '국어': [80, 90, 95, 70, 75, 85],
                    '영어': [90, 95, 70, 85, 90, 95],
                    '수학': [85, 95, 75, 80, 85, 100]}
df1 = pd.DataFrame(excel_exam_data1,columns=['학생','국어','영어','수학'] )
df1

  학생  국어  영어   수학
0  A  80  90   85
1  B  90  95   95
2  C  95  70   75
3  D  70  85   80
4  E  75  90   85
5  F  85  95  100

In [26]:
pd.ExcelWriter("학생시험성적2.xlsx", engine = 'xlsxwriter') # 1단계: 엑셀 객체 생성

In [25]:
ew = pd.ExcelWriter("학생시험성적2.xlsx", engine = 'xlsxwriter')

In [28]:
df1.to_excel(ew, index = False ) # 2단계: 엑셀 객체로 데이터 프레임을 만듦

In [31]:
ew.save() # 3단계: 엑셀 파일로 저장 -끗-

In [35]:
ew2 = pd.ExcelWriter("학생시험성적3.xlsx", engine = 'xlsxwriter') # 1단계: 엑셀 객체 생성
df1.to_excel(ew2, index = False, sheet_name = "중간고사" ) # 2단계: 엑셀 객체로 데이터 프레임을 만듦
ew2.save() # 3단계: 엑셀 파일로 저장 -끗-

In [36]:
excel_exam_data2 = {'학생': ['A', 'B', 'C', 'D', 'E', 'F'],
                    '국어': [85, 95, 75, 80, 85, 100],
                    '영어': [80, 90, 95, 70, 75, 85],
                    '수학': [90, 95, 70, 85, 90, 95]}
df2 = pd.DataFrame(excel_exam_data2,columns=['학생','국어','영어','수학'] )
df2

  학생   국어  영어  수학
0  A   85  80  90
1  B   95  90  95
2  C   75  95  70
3  D   80  70  85
4  E   85  75  90
5  F  100  85  95

In [37]:
print(df1)
print(df2)

  학생  국어  영어   수학
0  A  80  90   85
1  B  90  95   95
2  C  95  70   75
3  D  70  85   80
4  E  75  90   85
5  F  85  95  100
  학생   국어  영어  수학
0  A   85  80  90
1  B   95  90  95
2  C   75  95  70
3  D   80  70  85
4  E   85  75  90
5  F  100  85  95

In [38]:
ew3 = pd.ExcelWriter("학생시험성적4.xlsx", engine = "xlsxwriter")

In [39]:
df1.to_excel(ew3, index = False, sheet_name = "중간고사")
df2.to_excel(ew3, index = False, sheet_name = "기말고사")
ew3.save()

In [42]:
#엑셀 파일 여러 개 하나로 통합하는 방법

In [66]:
ex_data = ['담당자별_판매량_Andy사원.xlsx', '담당자별_판매량_Becky사원.xlsx', '담당자별_판매량_Chris사원.xlsx']

In [67]:
ex_data

['담당자별_판매량_Andy사원.xlsx', '담당자별_판매량_Becky사원.xlsx', '담당자별_판매량_Chris사원.xlsx']

In [74]:
import pandas as pd

In [75]:
df_tot = pd.DataFrame([]) # 데이터 초기화를 위해 넣어준 명령문

In [76]:
for i in ex_data:
    df = pd.read_excel(i)
    df_tot = df_tot.append(df, ignore_index = True)

In [77]:
df_tot

   제품명 담당자 지역  1분기  2분기  3분기  4분기
0   시계   A  가  198  123  120  137
1   구두   A  가  273  241  296  217
2  핸드백   A  가  385  316  355  331
3   시계   B  나  154  108  155  114
4   구두   B  나  200  223  213  202
5  핸드백   B  나  350  340  377  392
6   시계   C  다  168  102  149  174
7   구두   C  다  231  279  277  292
8  핸드백   C  다  365  383  308  323

In [78]:
import glob

In [79]:
# help(glob)

In [80]:
glob.glob('*.ipynb') # 이 코드 외워둘 것

['Chapter_11_NumPy_pandas.ipynb',
 'Chapter_12_matplotlib.ipynb',
 'Chapter_13_Working_with_excel.ipynb',
 'PandaDataFrameEx2(Describe에 대하여 정리).ipynb',
 'ReadWithEx.ipynb',
 'Untitled.ipynb',
 'Visualization Ex2.ipynb',
 'Visualization Ex6.ipynb',
 'Visualization Ex8.ipynb',
 'Visualization.ipynb',
 'WorkingWithExcel.ipynb']

In [81]:
glob.glob('담당자별*.xlsx')

['담당자별_판매량_Andy사원.xlsx', '담당자별_판매량_Becky사원.xlsx', '담당자별_판매량_Chris사원.xlsx']

In [85]:
import glob
ex_File = glob.glob('담당자별*.xlsx')
df_tot = pd.DataFrame([])
for i in ex_File:
    df = pd.read_excel(i)
    df_tot = df_tot.append(df, ignore_index = True)
    
    
ex_tot_file = pd.ExcelWriter("담당자별통합.xlsx", engine = "xlsxwriter")
df_tot.to_excel(ex_tot_file, index = False, sheet_name = "담당자별통합")
ex_tot_file.save()

In [88]:
df = pd.read_excel('담당자별_판매량_Andy사원.xlsx')

In [90]:
df

   제품명 담당자 지역  1분기  2분기  3분기  4분기
0   시계   A  가  198  123  120  137
1   구두   A  가  273  241  296  217
2  핸드백   A  가  385  316  355    0

In [100]:
df.loc[3, '제품명'] = '벨트'
df.loc[3, '담당자'] = 'Andy'
df.loc[3, '지역'] = '가'
df.loc[3, '1분기'] = '100'
df.loc[3, '2분기'] = '150'
df.loc[3, '3분기'] = '200'
df.loc[3, '4분기'] = '250'

In [101]:
df['담당자'] = 'Andy'

In [102]:
df

   제품명   담당자 지역  1분기  2분기  3분기  4분기
0   시계  Andy  가  198  123  120  137
1   구두  Andy  가  273  241  296  217
2  핸드백  Andy  가  385  316  355    0
3   벨트  Andy  가  100  150  200  250

In [108]:
import re # 정규표현식(=정규식, Regular Expression): 문자열의 패턴이 같은 경우 패턴을 찾아라

In [109]:
file_name = "담당자별_판매량_ Andy사원.xlsx"

In [115]:
re.sub('.xlsx','2.xlsx', file_name) # .xlsx 를 2.xlsx 로 대체할 것.

'담당자별_판매량_ Andy사원2.xlsx'

In [127]:
import glob
ex_File = glob.glob('담당자별*.xlsx') # *은 파일명에서 공통된 부분
df_tot = pd.DataFrame([])
for f in ex_File:
    df = pd.read_excel(f)
    if (df.loc[1,'담당자']=='A'):
        df['담당자']='Andy' # 담당자가 A이면 Andy로 바꿔라
    elif (df.loc[1,'담당자']=='B'):
        df['담당자']='Becky' 
    elif (df.loc[1,'담당자']=='C'):
        df['담당자']='Chris'
    
    f_new = re.sub('.xlsx', '2.xlsx', f)
    print(f_new)
    n_ex = pd.ExcelWriter(f_new, engine = 'xlsxwriter')
    df.to_excel(n_ex, index = False)
    n_ex.save()

담당자별_판매량_Andy사원2.xlsx
담당자별_판매량_Andy사원22.xlsx
담당자별_판매량_Andy사원222.xlsx
담당자별_판매량_Becky사원2.xlsx
담당자별_판매량_Becky사원22.xlsx
담당자별_판매량_Becky사원222.xlsx
담당자별_판매량_Chris사원2.xlsx
담당자별_판매량_Chris사원22.xlsx
담당자별_판매량_Chris사원222.xlsx
담당자별통합2.xlsx
담당자별통합22.xlsx
담당자별통합222.xlsx

In [130]:
import pandas as pd

df = pd.read_excel('담당자별통합.xlsx')
df

    제품명 담당자 지역  1분기  2분기  3분기  4분기
0    시계   A  가  198  123  120  137
1    구두   A  가  273  241  296  217
2   핸드백   A  가  385  316  355  331
3    시계   B  나  154  108  155  114
4    구두   B  나  200  223  213  202
5   핸드백   B  나  350  340  377  392
6    시계   C  다  168  102  149  174
7    구두   C  다  231  279  277  292
8   핸드백   C  다  365  383  308  323
9    시계   A  가  198  123  120  137
10   구두   A  가  273  241  296  217
11  핸드백   A  가  385  316  355  331
12   시계   B  나  154  108  155  114
13   구두   B  나  200  223  213  202
14  핸드백   B  나  350  340  377  392
15   시계   C  다  168  102  149  174
16   구두   C  다  231  279  277  292
17  핸드백   C  다  365  383  308  323

In [131]:
df[df['3분기']>=250]

    제품명 담당자 지역  1분기  2분기  3분기  4분기
1    구두   A  가  273  241  296  217
2   핸드백   A  가  385  316  355  331
5   핸드백   B  나  350  340  377  392
7    구두   C  다  231  279  277  292
8   핸드백   C  다  365  383  308  323
10   구두   A  가  273  241  296  217
11  핸드백   A  가  385  316  355  331
14  핸드백   B  나  350  340  377  392
16   구두   C  다  231  279  277  292
17  핸드백   C  다  365  383  308  323

In [134]:
#df.iloc[ ;, [0,3,4,5,6]]

In [136]:
df.iloc[ [0,2],: ]

   제품명 담당자 지역  1분기  2분기  3분기  4분기
0   시계   A  가  198  123  120  137
2  핸드백   A  가  385  316  355  331

In [137]:
handbag = df[df['제품명'] == '핸드백']

In [138]:
hand2 = handbag[['1분기','2분기','3분기','4분기']]

In [139]:
hand2.sum() #분기별 합계

1분기    2200
2분기    2078
3분기    2080
4분기    2092
dtype: int64